In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry','potter','spiderman'],
    "marks":['12','13','14'],
    "city":['rampur','kolkata']
}

In [4]:
dict1 = {
    "name":['harry','potter','spiderman'],
    "marks":['12','13','14'],
    "city":['rampur','kolkata','varanasi']
}

In [5]:
pd.DataFrame(dict1)

        name marks      city
0      harry    12    rampur
1     potter    13   kolkata
2  spiderman    14  varanasi

In [6]:
df.to_csv('friends.csv')

NameError: name 'df' is not defined

In [7]:
df = pd.DataFrame(dict1)

In [8]:
df

        name marks      city
0      harry    12    rampur
1     potter    13   kolkata
2  spiderman    14  varanasi

In [9]:
df.to_csv('friends.csv')

In [10]:
df.to_csv('friends_index_false.csv',index = False)

In [11]:
df.head(2)

     name marks     city
0   harry    12   rampur
1  potter    13  kolkata

In [12]:
df.tail(2)

        name marks      city
1     potter    13   kolkata
2  spiderman    14  varanasi

In [13]:
df.describe()

         name marks    city
count       3     3       3
unique      3     3       3
top     harry    12  rampur
freq        1     1       1

In [14]:
ali = pd.read_csv('friends.csv')

In [15]:
ali

   Unnamed: 0       name  marks      city
0           0      harry     12    rampur
1           1     potter     13   kolkata
2           2  spiderman     14  varanasi

In [16]:
ali['marks']

0    12
1    13
2    14
Name: marks, dtype: int64

In [17]:
ali['marks'][0]

12

In [18]:
ali['marks'][0] = 11

C:\Users\Lenovo\AppData\Local\Temp/ipykernel_18324/1057649099.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ali['marks'][0] = 11

In [19]:
ali

   Unnamed: 0       name  marks      city
0           0      harry     11    rampur
1           1     potter     13   kolkata
2           2  spiderman     14  varanasi

In [20]:
ali.to_csv('ali.csv')

# changing index

In [21]:
ali.index = ['one','two','three']

In [22]:
ali

       Unnamed: 0       name  marks      city
one             0      harry     11    rampur
two             1     potter     13   kolkata
three           2  spiderman     14  varanasi

In [23]:
import pandas as pd
points_table = {'Team_':['MI', 'CSK', 'Devils', 'MI', 'CSK',
   'RCB', 'CSK', 'CSK', 'KKR', 'KKR', 'KKR', 'RCB'],
   'Rank_' :[1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year_' :[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Point_':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(points_table)

groupby_= df.groupby('Year_')
for team,group in groupby_:
   print(team)
   print(group)

2014
    Team_  Rank_  Year_  Point_
0      MI      1   2014     876
2  Devils      2   2014     863
4     CSK      3   2014     741
9     KKR      4   2014     701
2015
   Team_  Rank_  Year_  Point_
1    CSK      2   2015     789
3     MI      3   2015     673
5    RCB      4   2015     812
10   KKR      1   2015     804
2016
  Team_  Rank_  Year_  Point_
6   CSK      1   2016     756
8   KKR      2   2016     694
2017
   Team_  Rank_  Year_  Point_
7    CSK      1   2017     788
11   RCB      2   2017     690

In [24]:
print (groupby_.get_group(2014))

    Team_  Rank_  Year_  Point_
0      MI      1   2014     876
2  Devils      2   2014     863
4     CSK      3   2014     741
9     KKR      4   2014     701

In [25]:
import numpy as np
groupby_.get_group(2014).agg([np.mean,np.median,np.std,np.var ])

           Rank_   Year_       Point_
mean    2.500000  2014.0   795.250000
median  2.500000  2014.0   802.000000
std     1.290994     0.0    87.439026
var     1.666667     0.0  7645.583333

In [26]:
print("Maximum value : ",df.Point_.max())
print("Minimum value : ",df.Point_.min())

Maximum value :  876
Minimum value :  673

In [27]:
df.count()

Team_     12
Rank_     12
Year_     12
Point_    12
dtype: int64

In [28]:
pd.count

AttributeError: module 'pandas' has no attribute 'count'

In [29]:
df.Team_.value_counts()

CSK       4
KKR       3
MI        2
RCB       2
Devils    1
Name: Team_, dtype: int64

In [30]:
df.describe()

           Rank_        Year_      Point_
count  12.000000    12.000000   12.000000
mean    2.166667  2015.166667  765.583333
std     1.114641     1.114641   67.849376
min     1.000000  2014.000000  673.000000
25%     1.000000  2014.000000  699.250000
50%     2.000000  2015.000000  772.000000
75%     3.000000  2016.000000  806.000000
max     4.000000  2017.000000  876.000000

# Visualizations using Pandas Dataframe

In [32]:
df = pd.DataFrame({'col1':[1,2,3,4],
'col2':[444,555,666,444],
'col3':[‘abc’,’def’,’ghi’,’xyz’]})
df.head()

SyntaxError: invalid character '‘' (U+2018) (Temp/ipykernel_18324/3753507708.py, line 3)

In [34]:
df = pd.DataFrame({'col1':[1,2,3,4],
'col2':[444,555,666,444],
'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Finding Unique Values:

In [35]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [36]:
len(df['col2'].unique())

3

In [37]:
df['col2'].nunique()

3

# Conditional Selections

In [38]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [39]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

# Apply Method

In [40]:
df['col2].sum()

SyntaxError: unterminated string literal (detected at line 1) (Temp/ipykernel_18324/2652293411.py, line 1)

In [41]:
df['col2'].sum()

2109

In [42]:
def times2(x):
    return x*2

In [43]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

# lambda expression:

# Removing Columns

In [44]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [45]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

# Returning The Columns Name & Index Attributes

In [47]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [48]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [49]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [50]:
df.Index()

AttributeError: 'DataFrame' object has no attribute 'Index'

# Sorting & Ordering a DataFrame

In [51]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [52]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [53]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# Booleans

In [54]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Pivot Tables

In [55]:
data=pd.DataFrame({'A':['foo','foo','foo','bar','bar','bar'],
'B':['one','one','two','two','one', 'one'],
'C':['x','y','x','y','x','y'],
'D':[1,3,2,5,4,1]})
#data
df=pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [56]:
df.pivot_table(values='D', index=['A','B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# series

In [1]:
ser = pd.Series(np.random.rand(34))

NameError: name 'pd' is not defined

In [2]:
import pandas as pd
import numpy as np

In [3]:
ser = pd.Series(np.random.rand(34))

In [4]:
type(ser)

pandas.core.series.Series

In [5]:
newdf = pd.DataFrame(np.random.rand(334,5),index = np.arange(334))

In [6]:
newdf

            0         1         2         3         4
0    0.933206  0.356706  0.867255  0.780201  0.291534
1    0.761038  0.923045  0.753570  0.268786  0.390402
2    0.322548  0.463014  0.680828  0.174043  0.318236
3    0.053841  0.033368  0.203904  0.722816  0.455244
4    0.119687  0.876600  0.194055  0.403510  0.364206
..        ...       ...       ...       ...       ...
329  0.627722  0.739972  0.580629  0.635118  0.469603
330  0.458728  0.455600  0.847667  0.506431  0.076280
331  0.689787  0.942063  0.655010  0.651538  0.209039
332  0.687602  0.594273  0.116586  0.360768  0.271495
333  0.558053  0.398693  0.166326  0.478666  0.097358

[334 rows x 5 columns]

In [7]:
type(newdf)

pandas.core.frame.DataFrame

In [8]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.501050    0.485792    0.508155    0.489234    0.508883
std      0.295414    0.272893    0.279386    0.289802    0.286548
min      0.003941    0.000773    0.004432    0.001524    0.005136
25%      0.236335    0.258550    0.272961    0.256618    0.283590
50%      0.495619    0.477050    0.535787    0.491175    0.510281
75%      0.758063    0.698769    0.736777    0.732976    0.771643
max      0.997866    0.995216    0.998592    0.998840    0.999840

In [10]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [11]:
df = pd.DataFrame(newdf)

In [12]:
df

            0         1         2         3         4
0    0.933206  0.356706  0.867255  0.780201  0.291534
1    0.761038  0.923045  0.753570  0.268786  0.390402
2    0.322548  0.463014  0.680828  0.174043  0.318236
3    0.053841  0.033368  0.203904  0.722816  0.455244
4    0.119687  0.876600  0.194055  0.403510  0.364206
..        ...       ...       ...       ...       ...
329  0.627722  0.739972  0.580629  0.635118  0.469603
330  0.458728  0.455600  0.847667  0.506431  0.076280
331  0.689787  0.942063  0.655010  0.651538  0.209039
332  0.687602  0.594273  0.116586  0.360768  0.271495
333  0.558053  0.398693  0.166326  0.478666  0.097358

[334 rows x 5 columns]

In [13]:
df.to_csv('series.csv')

In [14]:
newdf.head()

          0         1         2         3         4
0  0.933206  0.356706  0.867255  0.780201  0.291534
1  0.761038  0.923045  0.753570  0.268786  0.390402
2  0.322548  0.463014  0.680828  0.174043  0.318236
3  0.053841  0.033368  0.203904  0.722816  0.455244
4  0.119687  0.876600  0.194055  0.403510  0.364206

In [15]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.933206,0.761038,0.322548,0.053841,0.119687,0.829895,0.361813,0.590238,0.304198,0.408117,...,0.713847,0.959810,0.982779,0.173073,0.361994,0.627722,0.458728,0.689787,0.687602,0.558053
1,0.356706,0.923045,0.463014,0.033368,0.876600,0.405635,0.421963,0.166720,0.722034,0.192523,...,0.664519,0.044787,0.494486,0.399285,0.182643,0.739972,0.455600,0.942063,0.594273,0.398693
2,0.867255,0.753570,0.680828,0.203904,0.194055,0.487957,0.283818,0.041642,0.049886,0.456362,...,0.869902,0.877796,0.274282,0.841467,0.092774,0.580629,0.847667,0.655010,0.116586,0.166326
3,0.780201,0.268786,0.174043,0.722816,0.403510,0.256697,0.705973,0.749116,0.061314,0.668781,...,0.921280,0.110868,0.363295,0.567683,0.842270,0.635118,0.506431,0.651538,0.360768,0.478666
4,0.291534,0.390402,0.318236,0.455244,0.364206,0.963871,0.649756,0.846273,0.274173,0.118798,...,0.357924,0.826885,0.472652,0.660754,0.677442,0.469603,0.076280,0.209039,0.271495,0.097358

In [16]:
newdf.sort_index(axis = 0,ascending = False)

            0         1         2         3         4
333  0.558053  0.398693  0.166326  0.478666  0.097358
332  0.687602  0.594273  0.116586  0.360768  0.271495
331  0.689787  0.942063  0.655010  0.651538  0.209039
330  0.458728  0.455600  0.847667  0.506431  0.076280
329  0.627722  0.739972  0.580629  0.635118  0.469603
..        ...       ...       ...       ...       ...
4    0.119687  0.876600  0.194055  0.403510  0.364206
3    0.053841  0.033368  0.203904  0.722816  0.455244
2    0.322548  0.463014  0.680828  0.174043  0.318236
1    0.761038  0.923045  0.753570  0.268786  0.390402
0    0.933206  0.356706  0.867255  0.780201  0.291534

[334 rows x 5 columns]

In [17]:
newdf.sort_index(axis = 1,ascending = False)

            4         3         2         1         0
0    0.291534  0.780201  0.867255  0.356706  0.933206
1    0.390402  0.268786  0.753570  0.923045  0.761038
2    0.318236  0.174043  0.680828  0.463014  0.322548
3    0.455244  0.722816  0.203904  0.033368  0.053841
4    0.364206  0.403510  0.194055  0.876600  0.119687
..        ...       ...       ...       ...       ...
329  0.469603  0.635118  0.580629  0.739972  0.627722
330  0.076280  0.506431  0.847667  0.455600  0.458728
331  0.209039  0.651538  0.655010  0.942063  0.689787
332  0.271495  0.360768  0.116586  0.594273  0.687602
333  0.097358  0.478666  0.166326  0.398693  0.558053

[334 rows x 5 columns]

In [18]:
newdf[0]

0      0.933206
1      0.761038
2      0.322548
3      0.053841
4      0.119687
         ...
329    0.627722
330    0.458728
331    0.689787
332    0.687602
333    0.558053
Name: 0, Length: 334, dtype: float64

In [19]:
newdf2 = newdf

In [20]:
newdf

            0         1         2         3         4
0    0.933206  0.356706  0.867255  0.780201  0.291534
1    0.761038  0.923045  0.753570  0.268786  0.390402
2    0.322548  0.463014  0.680828  0.174043  0.318236
3    0.053841  0.033368  0.203904  0.722816  0.455244
4    0.119687  0.876600  0.194055  0.403510  0.364206
..        ...       ...       ...       ...       ...
329  0.627722  0.739972  0.580629  0.635118  0.469603
330  0.458728  0.455600  0.847667  0.506431  0.076280
331  0.689787  0.942063  0.655010  0.651538  0.209039
332  0.687602  0.594273  0.116586  0.360768  0.271495
333  0.558053  0.398693  0.166326  0.478666  0.097358

[334 rows x 5 columns]

In [21]:
newdf[0][0] = 123456

In [22]:
newdf2[0][0]= 4444444

In [23]:
newdf2

                0         1         2         3         4
0    4.444444e+06  0.356706  0.867255  0.780201  0.291534
1    7.610382e-01  0.923045  0.753570  0.268786  0.390402
2    3.225475e-01  0.463014  0.680828  0.174043  0.318236
3    5.384118e-02  0.033368  0.203904  0.722816  0.455244
4    1.196873e-01  0.876600  0.194055  0.403510  0.364206
..            ...       ...       ...       ...       ...
329  6.277221e-01  0.739972  0.580629  0.635118  0.469603
330  4.587279e-01  0.455600  0.847667  0.506431  0.076280
331  6.897871e-01  0.942063  0.655010  0.651538  0.209039
332  6.876025e-01  0.594273  0.116586  0.360768  0.271495
333  5.580531e-01  0.398693  0.166326  0.478666  0.097358

[334 rows x 5 columns]

In [25]:
newdf.loc[[1,2], [3,4]]

          3         4
1  0.268786  0.390402
2  0.174043  0.318236

# complex functions

In [26]:
import pandas as pd
import numpy as np

In [27]:
newdf

                0         1         2         3         4
0    4.444444e+06  0.356706  0.867255  0.780201  0.291534
1    7.610382e-01  0.923045  0.753570  0.268786  0.390402
2    3.225475e-01  0.463014  0.680828  0.174043  0.318236
3    5.384118e-02  0.033368  0.203904  0.722816  0.455244
4    1.196873e-01  0.876600  0.194055  0.403510  0.364206
..            ...       ...       ...       ...       ...
329  6.277221e-01  0.739972  0.580629  0.635118  0.469603
330  4.587279e-01  0.455600  0.847667  0.506431  0.076280
331  6.897871e-01  0.942063  0.655010  0.651538  0.209039
332  6.876025e-01  0.594273  0.116586  0.360768  0.271495
333  5.580531e-01  0.398693  0.166326  0.478666  0.097358

[334 rows x 5 columns]

In [28]:
newdf.loc[(newdf[0]<0.3)]

            0         1         2         3         4
3    0.053841  0.033368  0.203904  0.722816  0.455244
4    0.119687  0.876600  0.194055  0.403510  0.364206
15   0.087281  0.591940  0.271675  0.524591  0.508535
18   0.179027  0.653604  0.374691  0.718934  0.509662
26   0.052841  0.945845  0.205608  0.031964  0.695902
..        ...       ...       ...       ...       ...
303  0.053779  0.609480  0.396994  0.315194  0.397077
315  0.217470  0.659976  0.932727  0.955876  0.586720
316  0.253876  0.579385  0.639300  0.944725  0.147565
322  0.213049  0.790511  0.992286  0.392241  0.355829
327  0.173073  0.399285  0.841467  0.567683  0.660754

[101 rows x 5 columns]

In [29]:
newdf.loc[(newdf[0]<0.3) & (newdf[2]>0.1)]

            0         1         2         3         4
3    0.053841  0.033368  0.203904  0.722816  0.455244
4    0.119687  0.876600  0.194055  0.403510  0.364206
15   0.087281  0.591940  0.271675  0.524591  0.508535
18   0.179027  0.653604  0.374691  0.718934  0.509662
26   0.052841  0.945845  0.205608  0.031964  0.695902
..        ...       ...       ...       ...       ...
303  0.053779  0.609480  0.396994  0.315194  0.397077
315  0.217470  0.659976  0.932727  0.955876  0.586720
316  0.253876  0.579385  0.639300  0.944725  0.147565
322  0.213049  0.790511  0.992286  0.392241  0.355829
327  0.173073  0.399285  0.841467  0.567683  0.660754

[91 rows x 5 columns]

In [30]:
newdf.iloc[0,4]

0.2915342090770543

In [31]:
newdf.drop(1)

                0         1         2         3         4
0    4.444444e+06  0.356706  0.867255  0.780201  0.291534
2    3.225475e-01  0.463014  0.680828  0.174043  0.318236
3    5.384118e-02  0.033368  0.203904  0.722816  0.455244
4    1.196873e-01  0.876600  0.194055  0.403510  0.364206
5    8.298954e-01  0.405635  0.487957  0.256697  0.963871
..            ...       ...       ...       ...       ...
329  6.277221e-01  0.739972  0.580629  0.635118  0.469603
330  4.587279e-01  0.455600  0.847667  0.506431  0.076280
331  6.897871e-01  0.942063  0.655010  0.651538  0.209039
332  6.876025e-01  0.594273  0.116586  0.360768  0.271495
333  5.580531e-01  0.398693  0.166326  0.478666  0.097358

[333 rows x 5 columns]

In [1]:
newdf

NameError: name 'newdf' is not defined

In [2]:
import pandas as pd
import numpy as np

In [3]:
newdf

NameError: name 'newdf' is not defined

In [4]:
newdf = pd.DataFrame(np.random.rand(334,5),index = np.arange(334))

In [5]:
newdf

            0         1         2         3         4
0    0.877604  0.455001  0.451262  0.309657  0.487086
1    0.757953  0.817300  0.698169  0.713667  0.391940
2    0.322755  0.761951  0.937646  0.463781  0.980626
3    0.876475  0.265000  0.744188  0.582286  0.227060
4    0.069706  0.490169  0.952482  0.365175  0.254405
..        ...       ...       ...       ...       ...
329  0.116325  0.270571  0.080729  0.174802  0.921107
330  0.328091  0.943039  0.883498  0.383463  0.990681
331  0.491522  0.857877  0.352191  0.312825  0.165144
332  0.408820  0.333175  0.531142  0.608636  0.834171
333  0.163792  0.656410  0.340915  0.919871  0.851926

[334 rows x 5 columns]